/* automatically generated by rust-bindgen 0.72.1 */

pub use cuda_libs_cudart::sys::*;

pub const CUFFT_VER_MAJOR: u32 = 12;
pub const CUFFT_VER_MINOR: u32 = 2;
pub const CUFFT_VER_PATCH: u32 = 0;
pub const CUFFT_VER_BUILD: u32 = 46;
pub const CUFFT_VERSION: u32 = 12200;
pub const CUFFT_FORWARD: i32 = -1;
pub const CUFFT_INVERSE: u32 = 1;
pub const CUFFT_PLAN_NULL: i32 = -1;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Default, Copy, Clone)]
pub struct float2 {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of float2"][::std::mem::size_of::<float2>() - 8usize];
    ["Alignment of float2"][::std::mem::align_of::<float2>() - 8usize];
    ["Offset of field: float2::x"][::std::mem::offset_of!(float2, x) - 0usize];
    ["Offset of field: float2::y"][::std::mem::offset_of!(float2, y) - 4usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct double2 {
    pub x: f64,
    pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of double2"][::std::mem::size_of::<double2>() - 16usize];
    ["Alignment of double2"][::std::mem::align_of::<double2>() - 16usize];
    ["Offset of field: double2::x"][::std::mem::offset_of!(double2, x) - 0usize];
    ["Offset of field: double2::y"][::std::mem::offset_of!(double2, y) - 8usize];
};
pub type cuFloatComplex = float2;
pub type cuDoubleComplex = double2;
pub type cuComplex = cuFloatComplex;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstream_st {
    _unused: [u8; 0],
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum libraryPropertyType_t {
    MAJOR_VERSION = 0,
    MINOR_VERSION = 1,
    PATCH_LEVEL = 2,
}
pub use self::libraryPropertyType_t as libraryPropertyType;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cufftResult_t {
    CUFFT_SUCCESS = 0,
    CUFFT_INVALID_PLAN = 1,
    CUFFT_ALLOC_FAILED = 2,
    CUFFT_INVALID_TYPE = 3,
    CUFFT_INVALID_VALUE = 4,
    CUFFT_INTERNAL_ERROR = 5,
    CUFFT_EXEC_FAILED = 6,
    CUFFT_SETUP_FAILED = 7,
    CUFFT_INVALID_SIZE = 8,
    CUFFT_UNALIGNED_DATA = 9,
    CUFFT_INVALID_DEVICE = 11,
    CUFFT_NO_WORKSPACE = 13,
    CUFFT_NOT_IMPLEMENTED = 14,
    CUFFT_NOT_SUPPORTED = 16,
    CUFFT_MISSING_DEPENDENCY = 17,
    CUFFT_NVRTC_FAILURE = 18,
    CUFFT_NVJITLINK_FAILURE = 19,
    CUFFT_NVSHMEM_FAILURE = 20,
}
pub use self::cufftResult_t as cufftResult;
pub type cufftReal = f32;
pub type cufftDoubleReal = f64;
pub type cufftComplex = cuComplex;
pub type cufftDoubleComplex = cuDoubleComplex;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cufftType_t {
    CUFFT_R2C = 42,
    CUFFT_C2R = 44,
    CUFFT_C2C = 41,
    CUFFT_D2Z = 106,
    CUFFT_Z2D = 108,
    CUFFT_Z2Z = 105,
}
pub use self::cufftType_t as cufftType;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cufftCompatibility_t {
    CUFFT_COMPATIBILITY_FFTW_PADDING = 1,
}
pub use self::cufftCompatibility_t as cufftCompatibility;
pub type cufftHandle = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn cufftPlan1d(
        plan: *mut cufftHandle,
        nx: ::std::os::raw::c_int,
        type_: cufftType,
        batch: ::std::os::raw::c_int,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftPlan2d(
        plan: *mut cufftHandle,
        nx: ::std::os::raw::c_int,
        ny: ::std::os::raw::c_int,
        type_: cufftType,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftPlan3d(
        plan: *mut cufftHandle,
        nx: ::std::os::raw::c_int,
        ny: ::std::os::raw::c_int,
        nz: ::std::os::raw::c_int,
        type_: cufftType,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftPlanMany(
        plan: *mut cufftHandle,
        rank: ::std::os::raw::c_int,
        n: *mut ::std::os::raw::c_int,
        inembed: *mut ::std::os::raw::c_int,
        istride: ::std::os::raw::c_int,
        idist: ::std::os::raw::c_int,
        onembed: *mut ::std::os::raw::c_int,
        ostride: ::std::os::raw::c_int,
        odist: ::std::os::raw::c_int,
        type_: cufftType,
        batch: ::std::os::raw::c_int,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftMakePlan1d(
        plan: cufftHandle,
        nx: ::std::os::raw::c_int,
        type_: cufftType,
        batch: ::std::os::raw::c_int,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftMakePlan2d(
        plan: cufftHandle,
        nx: ::std::os::raw::c_int,
        ny: ::std::os::raw::c_int,
        type_: cufftType,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftMakePlan3d(
        plan: cufftHandle,
        nx: ::std::os::raw::c_int,
        ny: ::std::os::raw::c_int,
        nz: ::std::os::raw::c_int,
        type_: cufftType,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftMakePlanMany(
        plan: cufftHandle,
        rank: ::std::os::raw::c_int,
        n: *mut ::std::os::raw::c_int,
        inembed: *mut ::std::os::raw::c_int,
        istride: ::std::os::raw::c_int,
        idist: ::std::os::raw::c_int,
        onembed: *mut ::std::os::raw::c_int,
        ostride: ::std::os::raw::c_int,
        odist: ::std::os::raw::c_int,
        type_: cufftType,
        batch: ::std::os::raw::c_int,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftMakePlanMany64(
        plan: cufftHandle,
        rank: ::std::os::raw::c_int,
        n: *mut ::std::os::raw::c_longlong,
        inembed: *mut ::std::os::raw::c_longlong,
        istride: ::std::os::raw::c_longlong,
        idist: ::std::os::raw::c_longlong,
        onembed: *mut ::std::os::raw::c_longlong,
        ostride: ::std::os::raw::c_longlong,
        odist: ::std::os::raw::c_longlong,
        type_: cufftType,
        batch: ::std::os::raw::c_longlong,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetSizeMany64(
        plan: cufftHandle,
        rank: ::std::os::raw::c_int,
        n: *mut ::std::os::raw::c_longlong,
        inembed: *mut ::std::os::raw::c_longlong,
        istride: ::std::os::raw::c_longlong,
        idist: ::std::os::raw::c_longlong,
        onembed: *mut ::std::os::raw::c_longlong,
        ostride: ::std::os::raw::c_longlong,
        odist: ::std::os::raw::c_longlong,
        type_: cufftType,
        batch: ::std::os::raw::c_longlong,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftEstimate1d(
        nx: ::std::os::raw::c_int,
        type_: cufftType,
        batch: ::std::os::raw::c_int,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftEstimate2d(
        nx: ::std::os::raw::c_int,
        ny: ::std::os::raw::c_int,
        type_: cufftType,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftEstimate3d(
        nx: ::std::os::raw::c_int,
        ny: ::std::os::raw::c_int,
        nz: ::std::os::raw::c_int,
        type_: cufftType,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftEstimateMany(
        rank: ::std::os::raw::c_int,
        n: *mut ::std::os::raw::c_int,
        inembed: *mut ::std::os::raw::c_int,
        istride: ::std::os::raw::c_int,
        idist: ::std::os::raw::c_int,
        onembed: *mut ::std::os::raw::c_int,
        ostride: ::std::os::raw::c_int,
        odist: ::std::os::raw::c_int,
        type_: cufftType,
        batch: ::std::os::raw::c_int,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftCreate(handle: *mut cufftHandle) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetSize1d(
        handle: cufftHandle,
        nx: ::std::os::raw::c_int,
        type_: cufftType,
        batch: ::std::os::raw::c_int,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetSize2d(
        handle: cufftHandle,
        nx: ::std::os::raw::c_int,
        ny: ::std::os::raw::c_int,
        type_: cufftType,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetSize3d(
        handle: cufftHandle,
        nx: ::std::os::raw::c_int,
        ny: ::std::os::raw::c_int,
        nz: ::std::os::raw::c_int,
        type_: cufftType,
        workSize: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetSizeMany(
        handle: cufftHandle,
        rank: ::std::os::raw::c_int,
        n: *mut ::std::os::raw::c_int,
        inembed: *mut ::std::os::raw::c_int,
        istride: ::std::os::raw::c_int,
        idist: ::std::os::raw::c_int,
        onembed: *mut ::std::os::raw::c_int,
        ostride: ::std::os::raw::c_int,
        odist: ::std::os::raw::c_int,
        type_: cufftType,
        batch: ::std::os::raw::c_int,
        workArea: *mut usize,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetSize(handle: cufftHandle, workSize: *mut usize) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftSetWorkArea(
        plan: cufftHandle,
        workArea: *mut ::std::os::raw::c_void,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftSetAutoAllocation(
        plan: cufftHandle,
        autoAllocate: ::std::os::raw::c_int,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftExecC2C(
        plan: cufftHandle,
        idata: *mut cufftComplex,
        odata: *mut cufftComplex,
        direction: ::std::os::raw::c_int,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftExecR2C(
        plan: cufftHandle,
        idata: *mut cufftReal,
        odata: *mut cufftComplex,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftExecC2R(
        plan: cufftHandle,
        idata: *mut cufftComplex,
        odata: *mut cufftReal,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftExecZ2Z(
        plan: cufftHandle,
        idata: *mut cufftDoubleComplex,
        odata: *mut cufftDoubleComplex,
        direction: ::std::os::raw::c_int,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftExecD2Z(
        plan: cufftHandle,
        idata: *mut cufftDoubleReal,
        odata: *mut cufftDoubleComplex,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftExecZ2D(
        plan: cufftHandle,
        idata: *mut cufftDoubleComplex,
        odata: *mut cufftDoubleReal,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftSetStream(plan: cufftHandle, stream: cudaStream_t) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftDestroy(plan: cufftHandle) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetVersion(version: *mut ::std::os::raw::c_int) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetProperty(
        type_: libraryPropertyType,
        value: *mut ::std::os::raw::c_int,
    ) -> cufftResult;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cufftProperty_t {
    NVFFT_PLAN_PROPERTY_INT64_PATIENT_JIT = 1,
    NVFFT_PLAN_PROPERTY_INT64_MAX_NUM_HOST_THREADS = 2,
}
pub use self::cufftProperty_t as cufftProperty;
unsafe extern "C" {
    pub fn cufftSetPlanPropertyInt64(
        plan: cufftHandle,
        property: cufftProperty,
        inputValueInt: ::std::os::raw::c_longlong,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftGetPlanPropertyInt64(
        plan: cufftHandle,
        property: cufftProperty,
        returnPtrValue: *mut ::std::os::raw::c_longlong,
    ) -> cufftResult;
}
unsafe extern "C" {
    pub fn cufftResetPlanProperty(plan: cufftHandle, property: cufftProperty) -> cufftResult;
}
